Repository: muhamadalfian20892/FileLocker
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: id

source: Select File
id: Pilih File

source: Browse...
id: Jelajahi...

source: Enter Password
id: Masukkan Kata Sandi

source: Encrypt
id: Enkripsi

source: Decrypt
id: Dekripsi

source: Settings...
id: Pengaturan...

source: Open application settings
id: Buka pengaturan aplikasi

source: Exit
id: Keluar

source: About...
id: Tentang...

source: Settings
id: Pengaturan

source: Help
id: Bantuan

source: Ready
id: Siap

source: A simple tool to encrypt and decrypt files.
id: Alat sederhana untuk mengenkripsi dan mendekripsi file.

source: About FileLocker
id: Tentang FileLocker

source: Select a file
id: Pilih sebuah file

source: All files (*.*)|*.*
id: Semua file (*.*)|*.*

source: File selected: {}
id: File terpilih: {}

source: File path and password are required.
id: Lokasi file dan kata sandi wajib diisi.

source: Error
id: Kesalahan

source: Operation successful!
id: Operasi berhasil!

source: Operation completed successfully.
id: Operasi berhasil diselesaikan.

source: Success
id: Berhasil

source: Operation failed!
id: Operasi gagal!

source: File Locker window ready
id: Jendela Pengunci File siap

source: File Selection
id: Pemilihan File

source: Lock File
id: Kunci File

source: Unlock File
id: Buka Kunci File

source: Recent Files
id: File Terbaru

source: Password
id: Kata Sandi

source: Date
id: Tanggal

source: &Open Ctrl+O
id: &Buka Ctrl+O

source: E&xit Alt+F4
id: Ke&luar Alt+F4

source: &Settings Ctrl+,
id: &Pengaturan Ctrl+,

source: Clear Password &History
id: Hapus &Riwayat Kata Sandi

source: &About File Locker
id: &Tentang Pengunci File

source: &Tools
id: &Alat

source: &Help
id: &Bantuan

source: Cannot lock files in the program directory: {} This is a safety measure to keep the program files secure.
id: Tidak dapat mengunci file di direktori program: {} Ini adalah tindakan pengamanan untuk menjaga keamanan file program.

source: Locked
id: Terkunci

source: Unlocked
id: Terbuka

source: Selected: {}. Status: {}.
id: Terpilih: {}. Status: {}.

source: Filename
id: Nama File

source: Location
id: Lokasi

source: Size
id: Ukuran

source: Last Modified
id: Terakhir Diubah

source: Type
id: Tipe

source: No extension
id: Tanpa ekstensi

source: Error reading file info: {}
id: Kesalahan saat membaca info file: {}

source: Please drop a valid file.
id: Mohon letakkan file yang valid.

source: Choose a file
id: Pilih sebuah file

source: Please select a file first!
id: Silakan pilih file terlebih dahulu!

source: Are you sure you want to lock '{}'?
id: Apakah Anda yakin ingin mengunci '{}'?

source: Confirm Lock
id: Konfirmasi Kunci

source: Use last password for this file?
id: Gunakan kata sandi terakhir untuk file ini?

source: Use Last Password
id: Gunakan Kata Sandi Terakhir

source: Enter password for encryption:
id: Masukkan kata sandi untuk enkripsi:

source: Password cannot be empty!
id: Kata sandi tidak boleh kosong!

source: Locking File
id: Mengunci File

source: Locking {}...
id: Mengunci {}...

source: Encryption error: {}
id: Kesalahan enkripsi: {}

source: File has been locked successfully! File: {} Password: {} Please keep this password safe!
id: File berhasil dikunci! File: {} Kata Sandi: {} Harap simpan kata sandi ini dengan aman!

source: Failed to lock file!
id: Gagal mengunci file!

source: This file is not locked!
id: File ini tidak terkunci!

source: Are you sure you want to unlock '{}'?
id: Apakah Anda yakin ingin membuka kunci '{}'?

source: Confirm Unlock
id: Konfirmasi Buka Kunci

source: Enter password to unlock the file:
id: Masukkan kata sandi untuk membuka kunci file:

source: Unlocking File
id: Membuka Kunci File

source: Unlocking {}...
id: Membuka kunci {}...

source: Decryption error: {}
id: Kesalahan dekripsi: {}

source: File has been unlocked successfully!
id: File berhasil dibuka kuncinya!

source: Failed to unlock file! Please check if the password is correct.
id: Gagal membuka kunci file! Silakan periksa apakah kata sandi sudah benar.

source: Could not open file: {}
id: Tidak dapat membuka file: {}

source: File no longer exists!
id: File sudah tidak ada!

source: Attempting to unlock {} from history.
id: Mencoba membuka kunci {} dari riwayat.

source: Are you sure you want to clear all password history? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus semua riwayat kata sandi? Tindakan ini tidak dapat dibatalkan.

source: Confirm Clear History
id: Konfirmasi Hapus Riwayat

source: Password history has been cleared.
id: Riwayat kata sandi telah dihapus.

source: About File Locker dialog
id: Dialog Tentang Pengunci File

source: With this program, you can lock/unlock your secret file using a set of passwords. Features: - AES-256 encryption, - Password generation, - Password history, - File drag and drop support, - Theme support, - Auto-launch file after unlock.
id: Dengan program ini, Anda dapat mengunci/membuka kunci file rahasia Anda menggunakan serangkaian kata sandi. Fitur: - Enkripsi AES-256, - Pembuatan kata sandi, - Riwayat kata sandi, - Dukungan seret dan lepas file, - Dukungan tema, - Buka file otomatis setelah kunci dibuka.

source: Generate Password
id: Buat Kata Sandi

source: Generate Password dialog
id: Dialog Buat Kata Sandi

source: Generated Password
id: Kata Sandi yang Dibuat

source: Password Options
id: Opsi Kata Sandi

source: Password Length:
id: Panjang Kata Sandi:

source: Uppercase (A-Z)
id: Huruf Besar (A-Z)

source: Lowercase (a-z)
id: Huruf Kecil (a-z)

source: Digits (0-9)
id: Angka (0-9)

source: Symbols (!@#$%^&*)
id: Simbol (!@#$%^&*)

source: Generate New Password
id: Buat Kata Sandi Baru

source: Enter My Own Password
id: Masukkan Kata Sandi Sendiri

source: Copy to Clipboard
id: Salin ke Papan Klip

source: Use This Password
id: Gunakan Kata Sandi Ini

source: Cancel
id: Batal

source: Manual Password Entry
id: Entri Kata Sandi Manual

source: Enter your password:
id: Masukkan kata sandi Anda:

source: Please select at least one character type!
id: Harap pilih setidaknya satu jenis karakter!

source: Password copied to clipboard!
id: Kata sandi disalin ke papan klip!

source: Completed
id: Selesai

source: Settings dialog
id: Dialog Pengaturan

source: General
id: Umum

source: Security
id: Keamanan

source: Accessibility
id: Aksesibilitas

source: Save
id: Simpan

source: Reset to Defaults
id: Kembalikan ke Awal

source: Interface
id: Antarmuka

source: Remember last directory
id: Ingat direktori terakhir

source: Auto-launch files after unlock
id: Buka file otomatis setelah kunci dibuka

source: Theme:
id: Tema:

source: Default
id: Standar

source: Dark
id: Gelap

source: Language:
id: Bahasa:

source: Password Generation
id: Pembuatan Kata Sandi

source: Default password mode:
id: Mode kata sandi default:

source: Manual Entry
id: Entri Manual

source: Default password length:
id: Panjang kata sandi default:

source: Confirm file operations
id: Konfirmasi operasi file

source: Show password strength meter
id: Tampilkan pengukur kekuatan kata sandi

source: Maximum password history entries:
id: Jumlah maksimum entri riwayat kata sandi:

source: Clear Password History
id: Hapus Riwayat Kata Sandi

source: Screen Reader (NVDA)
id: Pembaca Layar (NVDA)

source: Enable NVDA Support
id: Aktifkan Dukungan NVDA

source: Verbosity Level:
id: Tingkat Kerincian:

source: Quiet
id: Singkat

source: Verbose
id: Rinci

source: Please restart the application for the language change to take effect.
id: Silakan mulai ulang aplikasi agar perubahan bahasa diterapkan.

source: Restart Required
id: Mulai Ulang Diperlukan

source: Settings saved.
id: Pengaturan disimpan.

source: Are you sure you want to reset all settings to defaults?
id: Apakah Anda yakin ingin mengembalikan semua pengaturan ke awal?

source: Confirm Reset
id: Konfirmasi Reset

source: Settings reset to defaults.
id: Pengaturan dikembalikan ke awal.

source: Are you sure you want to clear all password history?
id: Apakah Anda yakin ingin menghapus semua riwayat kata sandi?

source: Password history cleared successfully!
id: Riwayat kata sandi berhasil dihapus!

source: Password cannot be empty.
id: Kata sandi tidak boleh kosong.

source: File is not a .locked file.
id: File ini bukan file .locked.

source: Invalid password or corrupted file.
id: Kata sandi tidak valid atau file rusak.

source: Not a valid locked file or incorrect password
id: Bukan file terkunci yang valid atau kata sandi salah

source: Incorrect password or corrupted file.
id: Kata sandi salah atau file rusak.
